{
  "fields": [
    {
      "name": "interval",
      "type": "number",
      "default": 60,
      "description": "Interval in seconds to read your screen data and extract structured logs (will be used to summarize and send an email). Increase this value if using audio."
    },
    {
      "name": "summaryFrequency",
      "type": "string",
      "default": "daily",
      "description": "Frequency of summary emails: 'daily' for once a day at emailTime, or 'hourly:X' for every X hours (e.g., 'hourly:4' for every 4 hours)"
    },
    {
      "name": "emailTime",
      "type": "time",
      "default": "11:00",
      "description": "Time to send daily summary email (used only if summaryFrequency is 'daily')"
    },
    {
      "name": "emailAddress",
      "type": "string",
      "default": "<fill your email address here>",
      "description": "Email address to send the daily summary to"
    },
    {
      "name": "emailPassword",
      "type": "string",
      "default": "<fill your email password here>",
      "description": "App specific password for your gmail account, https://support.google.com/accounts/answer/185833?hl=en"
    },
    {
      "name": "ollamaApiUrl",
      "type": "string",
      "default": "http://localhost:11434/api",
      "description": "AI API URL, can be ollama, openai, any openai compatible API, risky to use cloud providers due to high usage"
    },
    {
      "name": "ollamaModel",
      "type": "string",
      "default": "llama3.2:3b-instruct-q4_K_M",
      "description": "AI Model"
    },
    {
      "name": "pageSize",
      "type": "number",
      "default": 100,
      "description": "Number of records to retrieve from screenpipe per page for structured extraction, keep in mind LLMs have a context window limit. Increase this value if using audio."
    },
    {
      "name": "customPrompt",
      "type": "string",
      "default": "You are an AI assistant tasked with extracting structured information from screen data (OCR). Analyze the following screen data and extract relevant information about my daily activity.",
      "description": "Custom prompt for the AI assistant that will be used to extract information from the screen data every few minutes"
    },
    {
      "name": "summaryPrompt",
      "type": "string",
      "default": "You are an AI assistant tasked with summarizing information that has previously been extracted from screen data (OCR) by another AI assistant. Analyze the following structured data extracted from my screen data and summarize my daily activity. This summary will be sent as an email to my address. Additionally, based on the activities and patterns observed, suggest 10 possible action items or tasks for the next day. These should be practical, relevant, and aimed at improving productivity or addressing any pending matters identified in the daily summary.",
      "description": "Summary prompt for the AI assistant that will be used to summarize the logs previously extracted, suggest action items for the next day, and send an email"
    },
    {
      "name": "windowName",
      "type": "window",
      "default": "",
      "description": "Specific window name to filter the screen data, for example 'gmail', 'john', 'slack', 'myCodeFile.tsx', etc. this will filter out audio"
    },
    {
      "name": "appName",
      "type": "app",
      "default": "",
      "description": "Specific application name to filter the screen data, for example 'Chrome', 'Visual Studio Code', 'Slack', etc. Leave empty to include all applications"
    },
    {
      "name": "contentType",
      "type": "contentType",
      "default": "ocr",
      "description": "Type of content to analyze: 'ocr', 'audio', or 'all'. OCR usually contains more content, so it's recommended to choose either OCR or audio rather than 'all' for better performance."
    }
  ]
}